<?
@extract($_GET); 
@extract($_POST); 
@extract($_SERVER);
$g4_path = ".."; // common.php 의 상대 경로
$g4_easynomu = "../erp";
include_once ("$g4_path/common_erp.php");

//로그인 해지시 로그인 페이지로 이동
//if(!$member['mb_name']) echo "<script>location.href='./';</script>";
if(!$member['mb_name']) {
	header('Location:./');
	exit;
}

$g4['member_table'] = "a4_member";
$g4['admin_path'] = "../admin";
$g4['insure_table'] = "a4_4insure";
$g4['com_list_gy'] = "com_list_gy";
$g4['pibohum_base'] = "pibohum_base";

//URL
$rooturl = "http://erp.easynomu.com/erp";
$rootssl = "https://erp.easynomu.com/erp";
//부서코드 160304							1				2							3			4			5	6		7	8		9	10	11		12			13					14				15		16	 		17 18	19			20				21		   22     23     24 25 26      27    28     29      30       31        32     33     34     35     36      37      38      39       40       41        42          43       44     45       46      	47    	48		49 																						 					50 					51 					52 			53 		54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70101
$dept_code_arry = array("","관리부","기업지원과","TM부","평택","","","","","","","창원","대전2","광주동부","대구동부","","대구남부","","","부산1","부산동부","울산","서울1","창원2","","","인천","김해","안산","서울2","서울3","서울동부","화성","거제","천안","양산","군산","진주","부산3","광주2","대구서부","부산팀","광주남부","서울남부","경산","원주","경산영업","순천","영주","아산",																									"부산서부","부산남부","서울서부","제주","","","","","");
$dept_code_arry[101] = "협력사1";
$dept_code_arry[102] = "제휴점";
$dept_code_arry[110] = "제휴점";
$dept_code_arry[111] = "제휴점2";
$dept_code_arry[112] = "제휴점3";
$dept_code_arry[113] = "제휴점4";
$dept_code_arry[114] = "제휴점5";
$dept_code_arry[120] = "전기공사";
$dept_code_arry[121] = "전기공사";
$dept_code_arry[122] = "수요관리";
$dept_code_arry[123] = "전기공사";
$dept_code_arry[124] = "전기공사";
$dept_code_arry[125] = "전기공사";
//지사 배열                      1      2      3      4       5       6       7      8     			9      10         11       12    13      14     15     16         17     18     19      20      	21     22      23      24      25      26     27     28     29      30       31     	32     33     34     35     36      37     38      39      40         41       42        43         44     45     46         47     48     49     50         51 				52 					53 		54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70101
$ban_cust_name_arry = array("","본사","창원","강릉","평택","대전1","대전2","고양","광주동부","대구1","대구동부","의정부","청주","목포","성남","전주","대구남부","나주","부산","부산1","부산동부","울산","서울1","창원2","딜러1","딜러2","인천","김해","안산","서울2","서울3","서울동부","화성","거제","천안","양산","군산","진주","부산3","광주2","대구서부","부산팀","광주남부","서울남부","경산","원주","경산영업","순천","영주","아산","부산서부","부산남부","서울서부","제주");
$man_cust_name_arry = array("","본사","창원","",    "평택","",     "",     "",    "광주동부","",     "",        "",      "",    "",    "",    "",    "대구남부","",    "",    "",     "부산동부","",    "",     "",     "",     "",     "인천","김해","안산","",     "",     "서울동부","",    "",    "천안","양산","군산","진주","",     "",     "대구서부","",      "광주남부","서울남부","경산","원주","",        "순천","영주","아산","부산서부","부산남부","서울서부","제주");
//협력사~딜러 총 12명 160205 / 12->10 전정애 대리 의견 161019 / 해지 지사 10개 / 평택 개설 161110 해지지사9
$man_cust_name_arry_cnt_add = 9;
//경산 -> 대구남부 151119
//순천 -> 광주2 151123
//안양 -> 원주 160108
//구미 -> 경산 160120
//48 영주 김민주 160217
//26 인천 정윤영, 이준석 160222
//49 홍성 160307
//50 부산서부 이명훈 160315
//53 제주 조훈태 161101
//4 평택 박온 161110

$man_cust_name_arry[101] = "협력사1";
//변현석
$man_cust_name_arry[110] = "제휴점";
//오형남
$man_cust_name_arry[111] = "제휴점2";
//노영래
$man_cust_name_arry[112] = "제휴점3";
//김민찬
$man_cust_name_arry[113] = "제휴점4";
//제해조
$man_cust_name_arry[114] = "제휴점5";
//광주딜러 160127
/*
$man_cust_name_arry[112] = "광주딜러1";
$man_cust_name_arry[113] = "광주딜러2";
$man_cust_name_arry[114] = "광주딜러3";
$man_cust_name_arry[115] = "광주딜러4";
$man_cust_name_arry[116] = "광주딜러5";
$man_cust_name_arry[117] = "광주딜러6";
$man_cust_name_arry[118] = "광주딜러7";
*/

//전기공사 허수원 사장, 안이사 / 수요관리(사룬) / 쌍용전설, 동양산전 / 성진전력 161214
$man_cust_name_arry[120] = "전기공사";
$man_cust_name_arry[121] = "전기공사";
$man_cust_name_arry[122] = "수요관리";
$man_cust_name_arry[123] = "전기공사";
$man_cust_name_arry[124] = "전기공사";
$man_cust_name_arry[125] = "전기공사";

//영업사원 권한 설정 : 사용안함
$man_cust_name_arry[301] = "본사영업1";
$man_cust_name_arry[302] = "본사영업2";

//이지노무 명칭
$mb_profile = $member['mb_profile'];
$easynomu_name = "ERP : ".$member['mb_nick']."(".$man_cust_name_arry[$mb_profile].") : ".$id;

//오늘날짜
$today = date("Y.m.d");
//기본서류                 0              1        2            3                  4                5              6          7                 8            9                10               11
$file_check_array = array("컨설팅의뢰서","계약서","사무위탁서","대리인선임(공단)","전자민원(센터)","사업자등록증","통장사본","취득/상실리스트","시간선택제","정책자금의뢰서","육아휴직장려금","대체인력지원금");
//지원금 배열, 수당료                1              2                 3               4         5         6          7          8            9             10               11                12                13                 14                 15              16            17         18         19         20         21         22             23               24               25               26               27(161215)	28
$support_kind_array = array("","55세다수고령","60세다수고령","정년퇴직자계속고용","정년연장","장애인","산재복귀","고용촉진","전문인력","시간선택제일자리","창업신규고용","창업부담금(전기)","창업부담금(물)","창업부담금(농지)","세금환급(취등록세)","산재요율","가족보험료환급","청년인턴","장년인턴","취업규칙","직무교육","정책자금","건설지원금","전기요금컨설팅","육아휴직장려금","대체인력지원금","직무발명보상제도","4대보험절감");
$support_kind_rate  = array("",  70           , 70           , 70                 , 70       , 70     , 70       , 50       , 70       , 70               , 70           , 70               , 70             , 50               , 50                 , 50       , 50             , 70       , 70       , 40       , 60       , 20       , 40         , 50             , 60             , 60             , 60              , 50);
//"고용환경개선","유망창업기업", 9,10 제거 160127
//회원레벨                   1         2       3        4          5       		6      7        	8       9         10
$level_array = array("","예비회원","전기공사","정회원","전기영업","지사영업","지사","영업사원","본사","준관리자","최고관리자");
//최초통화자(조선)
$writer_arry = array("","석정현","김수라","정경용","임영진");
//최초통화자(정책자금)         1        2        3        4        5        6
$writer_arry_policy = array("","정경용","임영진","황희경","양국일","박정민","엄희철");
$writer_arry_policy[1000]  = "김미정";
$writer_arry_policy[1030]  = "송인혜";
$writer_arry_policy[110]  = "관리부장";
$writer_arry_policy[122]  = "영업관리";
$writer_arry_policy[2001] = "최동환";
$writer_arry_policy[2002] = "부산2";
$writer_arry_policy[3501] = "양산";
$writer_arry_policy[3601] = "전북1";
$writer_arry_policy[1001] = "대구2";
$writer_arry_policy[25]   = "광주";
$writer_arry_policy[1602]   = "경산";
$writer_arry_policy[2301] = "창원2";
//업태
$uptae_arry = array("","농업","임업","어업","광업","제조","전기","가스","수도","건설","자동차판매","차량연료소매","상품중개","소매","도매","유통","숙박","음식점","운수","창고","통신","금융","보험","부동산","임대","보건","서비스","사업서비스","교육서비스","사회서비스","개인서비스","가사서비스","여행알선서비스","보육시설","사회복지","무역","단체,협회");
//관리공단지사
$samu_branch_arry = array("","강릉지사","경산지사","경인지역본부","고양지사","광산지사","광주지역본부","구미지사","군산지사","대구북부지사","대구서부지사","대구지역본부","대전지역본부","목포지사","보령지사","부산동부지사","부산북부지사","부산중부지사","부산지역본부","부천지사","서울강남지사","서울관악지사","서울남부지사","서울동부지사","서울북부지사","서울서부지사","서울서초지사","서울성동지사","서울지역본부","성남지사","수원지사","안동지사","안산지사","안양지사","양산지사","여수지사","영월지사","영주지사","울산지사","원주지사","유성지사","의정부지사","익산지사","인천북부지사","전주지사","제주지사","진주지사","창원지사","천안지사","청주지사","춘천지사","충주지사","태백지사","통영지사","평택지사","포항지사");
//직무교육 처리현황
$job_proxy_array = array("","서류미비","접수완료","인정자료완료","인정승인대기","인정자료수정","인정승인완료","실시신고중","교육중","교육완료","수료자보고","지원금신청","진행취소","보류","1차완료","2차완료","3차완료","4차완료");
//직무교육 첨부서류
$job_file_check_array = array("체크리스트","평면도","사진","교육시간표","교육자료","HRD신청서","훈련생명부","재직증명서");
//지원금 최종완료
$reapplication_done_array = array("","완료","반려","취소","이관");
//고용창출(시간선택제) 처리현황 150811
$job_time_process_arry = array("","진행대기","업무진행","참여신청","승인완료","진행불가","보류","불승인","연락대기","재연락","방문예정");
//전기요금컨설팅 처리현황 150812 조회불가 추가 150831 10상담완료 추가 160401 / 11한전접수, 12진행취소 전정애 주임 의견 160602 / 업무진행 -> 계약완료 변경 160614 / 13공사진행 추가 대표님 의견 160617 / 14수금진행 대표님 지시, 전정애 주임 의견 160630 / 15변경완료 김근호 사원 의견 160822
$electric_charges_process_arry = array("","조회불가","요금조회","계약진행","계약완료","진행불가","보류","공사완료","실사완료","최종완료","상담완료","한전접수","진행취소","공사진행","수금진행","변경완료","점검완료");
//지원대상조회 처리현황 150925
$support_person_process_arry = array("","진행중","서류요청","지원금신청","최종완료","해당없음","공문발송","보류","계약진행");
//신규고용확인 처리현황 151117 차후약정->재연락(부장님 요청) 160104
$employment_process_arry = array("","의뢰","진행","접수","완료","해당없음","검토","보류","약정","확인","재연락","대상없음","서류요청","지원금신청","검토불가");
//감원방지기간조회 처리현황 151116
$reduction_process_arry = array("","확인","진행","지원금신청","최종완료","해당없음","검토","보류","계약진행");
//피보험자 신고구분
//$report_kind_arry = array("","취득신고","상실신고","보수변경","성립신고","소멸신고","변경신고","예외재개","기타");
//														1						2						3						4					5						6					7					8						9					10				11
$report_kind_arry = array("","취득신고","상실신고","보수변경","성립신고","소멸신고","변경신고","납부예외","납부재개","이직신고","두루누리","기타");
//가족보험료환급 처리현황 151030
$family_process_arry = array("","검토중","처리중","공단접수","완료","취소","보류");
//대리인 160318
$agent_elect_public_charge_arry = array("","모영희","최명진","김봉균","최성민");
//그룹웨어 전자결재 문서구분
$doc_type_arry = array("","업무일지","근태신청","시말서","휴가신청");
//휴가신청서 종류
$vacation_report_kind_arry = array("","연차","하계휴가","경조휴가","산전산후","기타");
//근태신청서 종류
$attendance_report_kind_arry = array("","훈련신청서","조퇴신청서","외출신청서","지각사유서","결근사유서","기타사유서");
//전기공사업체 160729 / 삼호전력 -> 금오이엔지 (대표님 지시) 161006 / 정우기술 -> 그린솔라 161014 / 금오이엔지 -> 동양산전 161025 / 그린솔라 -> 동성에버그린 161026
//동성에버그린 -> 쌍용전설 161101 / 성진전력 161214
$electric_charges_construct_arry =  array("","동방전력","극동전력","쌍용전설","동양산전","성진전력");
//직무발명보상제도 처리현황 160926
$job_invent_process_arry = array("","계약진행","계약완료","진행불가","보류","상담완료","진행취소","수금진행","최종완료");
//전력수요관리 처리현황 160927
$kepco_dsm_process_arry = array("","계약진행","계약완료","진행불가","보류","부분감축","진행취소","수금진행","최종완료","감축1차","감축2차","감축3차","감축4차","감축시험1","감축시험2");
//4대보험절감 처리현황 160927 / 셋팅중, 검토중 추가 161014 / 접수중 10 추가 161025
$si4n_nhis_process_arry = array("","계약진행","계약완료","진행불가","보류","셋팅중","진행취소","수금진행","최종완료","검토중","접수중");
?>
